doe/cases_staging/openfoam_case_rans_fast/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

xMin   -0.30;
xMax    0.30;
yMin   -0.30;
yMax    1.50;
zMin   -0.10;
zMax    9.30;

vertices
(
    ($xMin $yMin $zMin)
    ($xMax $yMin $zMin)
    ($xMax $yMax $zMin)
    ($xMin $yMax $zMin)
    ($xMin $yMin $zMax)
    ($xMax $yMin $zMax)
    ($xMax $yMax $zMax)
    ($xMin $yMax $zMax)
);

// Background: 20x60x310 = 372,000 cells (~30 mm each)
// After snappy level 1 refinement -> ~1.2-1.5 M cells
blocks
(
    hex (0 1 2 3 4 5 6 7) (20 60 310) simpleGrading (1 1 1)
);

edges ();

boundary
(
    allBoundary
    {
        type patch;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (0 1 5 4)
            (3 7 6 2)
            (0 4 7 3)
            (1 2 6 5)
        );
    }
);

mergePatchPairs ();
