doe/cases_staging/openfoam_case_rans_fast/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    wall.stl          { type triSurfaceMesh; name wall; }
    main_inlet.stl    { type triSurfaceMesh; name main_inlet; }
    outlet.stl        { type triSurfaceMesh; name outlet; }
    branch_inlet.stl  { type triSurfaceMesh; name branch_inlet; }

    junctionRefine
    {
        type    searchableSphere;
        centre  (0 0 4.6);
        radius  0.690;
    }
}

castellatedMeshControls
{
    maxLocalCells       500000;
    maxGlobalCells      3000000;
    minRefinementCells  10;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 2;

    features
    (
        { file "wall.eMesh";         level 1; }
        { file "main_inlet.eMesh";   level 0; }
        { file "outlet.eMesh";       level 0; }
        { file "branch_inlet.eMesh"; level 1; }
    );

    refinementSurfaces
    {
        wall
        {
            level (1 1);
            patchInfo { type wall; }
        }
        main_inlet
        {
            level (0 0);
            patchInfo { type patch; }
        }
        outlet
        {
            level (0 0);
            patchInfo { type patch; }
        }
        branch_inlet
        {
            level (1 1);
            patchInfo { type patch; }
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        junctionRefine
        {
            mode    inside;
            levels  ((1e15 1));
        }
    }

    locationInMesh (0 0 2.0);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch            3;
    tolerance               2.0;
    nSolveIter              50;
    nRelaxIter              5;
    nFeatureSnapIter        10;
    implicitFeatureSnap     false;
    explicitFeatureSnap     true;
    multiRegionFeatureSnap  false;
}

addLayersControls
{
    relativeSizes       true;

    layers
    {
        wall
        {
            nSurfaceLayers  3;
        }
    }

    expansionRatio          1.3;
    finalLayerThickness     0.5;
    minThickness            0.15;
    nGrow                   0;
    featureAngle            60;
    slipFeatureAngle        30;
    nRelaxIter              5;
    nSmoothSurfaceNormals   1;
    nSmoothNormals          3;
    nSmoothThickness        10;
    maxFaceThicknessRatio   0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle      90;
    nBufferCellsNoExtrude   0;
    nLayerIter              30;
}

meshQualityControls
{
    maxNonOrtho         65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave          80;
    minVol              1e-13;
    minTetQuality       1e-15;
    minArea             -1;
    minTwist            0.05;
    minDeterminant      0.001;
    minFaceWeight       0.05;
    minVolRatio         0.01;
    minTriangleTwist    -1;

    nSmoothScale        4;
    errorReduction      0.75;
}

writeFlags ( scalarLevels );

mergeTolerance  1e-6;
