doe/cases_staging/openfoam_case_rans_fast/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains  16;
method              scotch;
